eksempel/testxml/iti41-request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
	<soap:Header>
		<Action soap:mustUnderstand="true"
			xmlns="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</Action>
		<MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:49d1255d-bf6f-4939-82ff-64143db3f626
		</MessageID>
		<To xmlns="http://www.w3.org/2005/08/addressing">https://sdsxdsudv.kvalitetsit.dk:9443/repository/services/xds-iti41
		</To>
		<ReplyTo soap:mustUnderstand="true"
			xmlns="http://www.w3.org/2005/08/addressing">
			<Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
		</ReplyTo>
	</soap:Header>
	<soap:Body>
		<ns4:ProvideAndRegisterDocumentSetRequest
			xmlns:ns6="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:ns5="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0"
			xmlns:ns4="urn:ihe:iti:xds-b:2007" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0"
			xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
			<ns5:SubmitObjectsRequest>
				<ns2:RegistryObjectList>
					<ns2:ExtrinsicObject
						lid="8284760064608749953.2453814017440396770.1506000680165"
						objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1" status="urn:oasis:names:tc:ebxml-regrep:StatusType:Approved"
						id="8284760064608749953.2453814017440396770.1506000680165">
						<ns2:Slot name="creationTime">
							<ns2:ValueList>
								<ns2:Value>20170113100000</ns2:Value>
							</ns2:ValueList>
						</ns2:Slot>
						<ns2:Slot name="serviceStartTime">
							<ns2:ValueList>
								<ns2:Value>20170531120000</ns2:Value>
							</ns2:ValueList>
						</ns2:Slot>
						<ns2:Slot name="serviceStopTime">
							<ns2:ValueList>
								<ns2:Value>20170531130000</ns2:Value>
							</ns2:ValueList>
						</ns2:Slot>
						<ns2:Slot name="sourcePatientId">
							<ns2:ValueList>
								<ns2:Value>2512489996^^^&amp;1.2.208.176.1.2&amp;ISO</ns2:Value>
							</ns2:ValueList>
						</ns2:Slot>
						<ns2:Name>
							<ns2:LocalizedString xml:lang="en-US"
								charset="UTF-8" value="Aftale for 2512489996" />
						</ns2:Name>
						<ns2:Classification
							classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d"
							classifiedObject="8284760064608749953.2453814017440396770.1506000680165"
							nodeRepresentation=""
							id="urn:uuid:390f8d00-8d1f-41ac-a8af-f57d620e056f">
							<ns2:Slot name="authorInstitution">
								<ns2:ValueList>
									<ns2:Value>OUH Radiologisk Afdeling
										(Svendborg)^^^^^&amp;1.2.208.176.1.1&amp;ISO^^^^242621000016001
									</ns2:Value>
								</ns2:ValueList>
							</ns2:Slot>
						</ns2:Classification>
						<ns2:Classification
							classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a"
							classifiedObject="8284760064608749953.2453814017440396770.1506000680165"
							nodeRepresentation="001"
							id="urn:uuid:86c685e8-3163-4b45-9d59-3e0fcd9e6462">
							<ns2:Slot name="codingScheme">
								<ns2:ValueList>
									<ns2:Value>1.2.208.184.100.9</ns2:Value>
								</ns2:ValueList>
							</ns2:Slot>
							<ns2:Name>
								<ns2:LocalizedString xml:lang="en-US"
									charset="UTF-8" value="Klinisk rapport" />
							</ns2:Name>
						</ns2:Classification>
						<ns2:Classification
							classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d"
							classifiedObject="8284760064608749953.2453814017440396770.1506000680165"
							nodeRepresentation="urn:ad:dk:medcom:appointment"
							id="urn:uuid:dc1c2b09-d1a5-48b7-8b82-396f67a436da">
							<ns2:Slot name="codingScheme">
								<ns2:ValueList>
									<ns2:Value>1.2.208.184.14.1</ns2:Value>
								</ns2:ValueList>
							</ns2:Slot>
							<ns2:Name>
								<ns2:LocalizedString xml:lang="en-US"
									charset="UTF-8" value="DK CDA APD" />
							</ns2:Name>
						</ns2:Classification>
						<ns2:Classification
							classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1"
							classifiedObject="8284760064608749953.2453814017440396770.1506000680165"
							nodeRepresentation="22232009"
							id="urn:uuid:afeeca83-30b8-4e72-9eb0-6a716d7264d8">
							<ns2:Slot name="codingScheme">
								<ns2:ValueList>
									<ns2:Value>2.16.840.1.113883.6.96</ns2:Value>
								</ns2:ValueList>
							</ns2:Slot>
							<ns2:Name>
								<ns2:LocalizedString xml:lang="en-US"
									charset="UTF-8" value="hospital" />
							</ns2:Name>
						</ns2:Classification>
						<ns2:Classification
							classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead"
							classifiedObject="8284760064608749953.2453814017440396770.1506000680165"
							nodeRepresentation="408443003"
							id="urn:uuid:a69c7fc2-1a88-4cbe-986b-5753f83e97c6">
							<ns2:Slot name="codingScheme">
								<ns2:ValueList>
									<ns2:Value>2.16.840.1.113883.6.96</ns2:Value>
								</ns2:ValueList>
							</ns2:Slot>
							<ns2:Name>
								<ns2:LocalizedString xml:lang="en-US"
									charset="UTF-8" value="almen medicin" />
							</ns2:Name>
						</ns2:Classification>
						<ns2:Classification
							classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983"
							classifiedObject="8284760064608749953.2453814017440396770.1506000680165"
							nodeRepresentation="39289-4"
							id="urn:uuid:1b796f8a-5f74-4411-914d-f3f6add9a56e">
							<ns2:Slot name="codingScheme">
								<ns2:ValueList>
									<ns2:Value>2.16.840.1.113883.6.1</ns2:Value>
								</ns2:ValueList>
							</ns2:Slot>
							<ns2:Name>
								<ns2:LocalizedString xml:lang="en-US"
									charset="UTF-8"
									value="Dato og tidspunkt for møde mellem patient og sundhedsperson" />
							</ns2:Name>
						</ns2:Classification>
						<ns2:ExternalIdentifier
							registryObject="8284760064608749953.2453814017440396770.1506000680165"
							identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427"
							value="2512489996^^^&amp;1.2.208.176.1.2&amp;ISO" id="urn:uuid:9fdb1333-ce2f-4ce8-ae18-8def2b40210f">
							<ns2:Name>
								<ns2:LocalizedString value="XDSDocumentEntry.patientId" />
							</ns2:Name>
						</ns2:ExternalIdentifier>
						<ns2:ExternalIdentifier
							registryObject="8284760064608749953.2453814017440396770.1506000680165"
							identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab"
							value="4619091542759068279.4584476099589391958.1506000680164" id="urn:uuid:a8ea8321-9e51-4977-9afc-197cd02aed0d">
							<ns2:Name>
								<ns2:LocalizedString value="XDSDocumentEntry.uniqueId" />
							</ns2:Name>
						</ns2:ExternalIdentifier>
					</ns2:ExtrinsicObject>
					<ns2:RegistryPackage
						status="urn:oasis:names:tc:ebxml-regrep:StatusType:Approved" id="6558028271042934059.3052398441165403753.1506000680168">
						<ns2:Slot name="submissionTime">
							<ns2:ValueList>
								<ns2:Value>20170113100000</ns2:Value>
							</ns2:ValueList>
						</ns2:Slot>
						<ns2:Classification
							classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500"
							classifiedObject="6558028271042934059.3052398441165403753.1506000680168"
							nodeRepresentation="39289-4"
							id="urn:uuid:c4b500dc-ec1c-4858-acd4-7530163504f3">
							<ns2:Slot name="codingScheme">
								<ns2:ValueList>
									<ns2:Value>2.16.840.1.113883.6.1</ns2:Value>
								</ns2:ValueList>
							</ns2:Slot>
							<ns2:Name>
								<ns2:LocalizedString xml:lang="en-US"
									charset="UTF-8"
									value="Dato og tidspunkt for møde mellem patient og sundhedsperson" />
							</ns2:Name>
						</ns2:Classification>
						<ns2:ExternalIdentifier
							registryObject="6558028271042934059.3052398441165403753.1506000680168"
							identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446"
							value="2512489996^^^&amp;1.2.208.176.1.2&amp;ISO" id="urn:uuid:83561f94-30e5-4ce6-bfe2-551735e99499">
							<ns2:Name>
								<ns2:LocalizedString value="XDSSubmissionSet.patientId" />
							</ns2:Name>
						</ns2:ExternalIdentifier>
						<ns2:ExternalIdentifier
							registryObject="6558028271042934059.3052398441165403753.1506000680168"
							identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8"
							value="6558028271042934059.3052398441165403753.1506000680168" id="urn:uuid:603c05ac-3901-4c89-afdc-4c622c1e0051">
							<ns2:Name>
								<ns2:LocalizedString value="XDSSubmissionSet.uniqueId" />
							</ns2:Name>
						</ns2:ExternalIdentifier>
						<ns2:ExternalIdentifier
							registryObject="6558028271042934059.3052398441165403753.1506000680168"
							identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832"
							value="6558028271042934059.3052398441165403753.1506000680168" id="urn:uuid:1ec345c0-6f11-4167-9c63-9ce8d86b3c5d">
							<ns2:Name>
								<ns2:LocalizedString value="XDSSubmissionSet.sourceId" />
							</ns2:Name>
						</ns2:ExternalIdentifier>
					</ns2:RegistryPackage>
					<ns2:Classification
						classifiedObject="6558028271042934059.3052398441165403753.1506000680168"
						classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd"
						id="urn:uuid:8489ad6f-4711-4b61-a386-482d1e505a70" />
					<ns2:Association
						associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember"
						sourceObject="6558028271042934059.3052398441165403753.1506000680168"
						targetObject="8284760064608749953.2453814017440396770.1506000680165"
						status="urn:oasis:names:tc:ebxml-regrep:StatusType:Approved" id="6144088823968590601.40868175283009434.1506000680170">
						<ns2:Slot name="SubmissionSetStatus">
							<ns2:ValueList>
								<ns2:Value>Original</ns2:Value>
							</ns2:ValueList>
						</ns2:Slot>
					</ns2:Association>
				</ns2:RegistryObjectList>
			</ns5:SubmitObjectsRequest>
			<ns4:Document id="8284760064608749953.2453814017440396770.1506000680165">
				<xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include"
					href="cid:20d45359-6131-429b-a53b-2872b45a1c06-1@urn%3Aihe%3Aiti%3Axds-b%3A2007" />
			</ns4:Document>
		</ns4:ProvideAndRegisterDocumentSetRequest>
	</soap:Body>
</soap:Envelope>
